DELETE FROM `access_requirement` WHERE (`mapId`='37') AND (`difficulty`='0');
INSERT INTO `access_requirement` VALUES (37, 0, 1, 0, 0, 0, 0, 0, 0, NULL, NULL);

DELETE FROM `instance_template` WHERE (`map`='37');
INSERT INTO `instance_template` VALUES (37, 1, '', 1);

DELETE FROM `item_template` WHERE (`entry`='56807');
DELETE FROM `item_template` WHERE (`entry`='56808');
INSERT INTO `item_template` VALUES (56807, 15, 5, -1, 'X-53型观光火箭', 67573, 7, 0, 0, 1, 100000, 0, 0, 262143, -1, 1, 1, 762, 225, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55884, 0, -1, 0, -1, 330, 3000, 91114, 6, 0, 0, -1, 0, -1, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, -1, 0, -1, 1, '教你学会召唤这种坐骑。', 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 12340);
INSERT INTO `item_template` VALUES (56808, 4, 0, -1, '代达罗斯之殇', 31310, 6, 0, 0, 1, 482145, 120536, 12, 2047, 2097151, 300, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 81, 81, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 91112, 1, 0, 0, -1, 0, 0, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, -1, 0, -1, 0, 0, 0, 0, -1, 0, -1, 1, '它其实就是暴雪弩炮……', 0, 0, 0, 0, 0, 4, 0, 0, 998, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 375, 0, 0, 0, 0, '', 69, 0, 0, 0, 0, 12340);

DELETE FROM `spell_bonus_data` WHERE (`entry`='91113');
INSERT INTO `spell_bonus_data` VALUES (91113, 0, -1, -1, -1, '暴雪弩炮');